applications/test/elbow/constant/UBC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      UBC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 0 0 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    wall-4
    {
        type            generalFixedValue;
        value           (0 0 0);
    }

    velocity-inlet-5
    {
        type            generalFixedValue;
        value           (1984.35 0 0);
    }

    velocity-inlet-6
    {
        type            generalFixedValue;
        value           (1984.35 0 0);
    }

    pressure-outlet-7
    {
        type            generalZeroGradient;
    }

    wall-8
    {
        type            generalFixedValue;
        value           (0 0 0);
    }

    frontAndBackPlanes
    {
        type            generalFixedValue;
	value           (0 0 0);
    }
}


// ************************************************************************* //
