applications/test/elbow/constant/pBC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      pBC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalField   uniform 1e5;

boundaryField
{
    wall-4
    {
        type            generalZeroGradient;
    }

    velocity-inlet-5
    {
        type            generalFixedValue;
        value           0.1;
    }

    velocity-inlet-6
    {
        type            generalFixedValue;
        value           0.1;
    }

    pressure-outlet-7
    {
        type            generalFixedValue;
        value           0.1;
    }

    wall-8
    {
        type            generalZeroGradient;
    }

    frontAndBackPlanes
    {
        type            generalZeroGradient;
    }
}


// ************************************************************************* //
